#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-postech-tsombra/fiap-cloud-infra-tf/runs/run-6HgpL3oKL33CCSrc

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
google_project_service.secretmanager_api: Refreshing state... [id=lateral-scion-414400/secretmanager.googleapis.com]
google_project_service.cloudrun_api: Refreshing state... [id=lateral-scion-414400/run.googleapis.com]
google_project_service.sqladmin_api: Refreshing state... [id=lateral-scion-414400/sqladmin.googleapis.com]
google_cloud_run_v2_service.fiap-postech: Refreshing state... [id=projects/lateral-scion-414400/locations/us-central1/services/fiap-pos-tech]
google_cloud_run_v2_service.fiap-postech: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.fiap-postech will be created
  + resource "google_cloud_run_v2_service" "fiap-postech" {
      + client                  = "terraform"
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + name                    = "dummy"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)
        # (1 unchanged attribute hidden)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "southamerica-east1-docker.pkg.dev/lateral-scion-414400/fiap/dummy:301ce943380d6737df622a2db491da683ba5fec4"

              + env {
                  + name  = "DATABASE_URL"
                  + value = "mysql://:@localhost/?socket=/cloudsql/dummy_instance"
                }

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = [
                      + "dummy_instance",
                    ]
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tshadz, Action: `pull_request`*